{"backend": "tensorflow", "keras_version": "2.0.8", "config": [{"config": {"batch_input_shape": [null, 160, 320, 3], "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e9\u00ff\u0000\u0000\u0000\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>R\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "trainable": true, "arguments": {}, "output_shape": null, "output_shape_type": "raw", "dtype": "float32", "name": "lambda_1", "function_type": "lambda"}, "class_name": "Lambda"}, {"config": {"cropping": [[70, 25], [0, 0]], "data_format": "channels_last", "name": "cropping2d_1", "trainable": true}, "class_name": "Cropping2D"}, {"config": {"kernel_constraint": null, "strides": [2, 2], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [5, 5], "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "padding": "valid", "bias_regularizer": null, "filters": 24, "name": "conv2d_1", "use_bias": true}, "class_name": "Conv2D"}, {"config": {"kernel_constraint": null, "strides": [2, 2], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [5, 5], "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "padding": "valid", "bias_regularizer": null, "filters": 36, "name": "conv2d_2", "use_bias": true}, "class_name": "Conv2D"}, {"config": {"kernel_constraint": null, "strides": [2, 2], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [5, 5], "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "padding": "valid", "bias_regularizer": null, "filters": 48, "name": "conv2d_3", "use_bias": true}, "class_name": "Conv2D"}, {"config": {"kernel_constraint": null, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [3, 3], "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "padding": "valid", "bias_regularizer": null, "filters": 64, "name": "conv2d_4", "use_bias": true}, "class_name": "Conv2D"}, {"config": {"kernel_constraint": null, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [3, 3], "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "padding": "valid", "bias_regularizer": null, "filters": 64, "name": "conv2d_5", "use_bias": true}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "dropout_1", "rate": 0.7}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activity_regularizer": null, "units": 100, "activation": "linear", "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_regularizer": null, "name": "dense_1", "use_bias": true}, "class_name": "Dense"}, {"config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activity_regularizer": null, "units": 50, "activation": "linear", "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_regularizer": null, "name": "dense_2", "use_bias": true}, "class_name": "Dense"}, {"config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activity_regularizer": null, "units": 10, "activation": "linear", "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_regularizer": null, "name": "dense_3", "use_bias": true}, "class_name": "Dense"}, {"config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activity_regularizer": null, "units": 1, "activation": "linear", "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_regularizer": null, "name": "dense_4", "use_bias": true}, "class_name": "Dense"}], "class_name": "Sequential"}